
print("||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||\n|                                                                                                      |\n| Программа, считывает номер кармана и показывает, является ли этот карман зеленым, красным или черным |\n|                                                                                                      |\n||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||")
###
num = int(input("\nВведите номер кармана(от 1 до 36):"))

###

if num>36 or num<0:
    print("\n      !!ОШИБКА!!\n\nВВЕДИТЕ ЧИСЛО ОТ 1 ДО 36!!")

###

if num == 0:
    print("\nзеленый")
elif 1 <= num <= 10 and num % 2 == 0:
    print("\nчерный")
elif 1 <= num <= 10 and num % 2 == 1:
    print("\nкрасный")

###

if 11 <= num <= 18 and num % 2 == 0:
    print("\nкрасный")
elif 1 <= num <= 10 and num % 2 == 1:
    print("\nчерный")

###

if 19 <= num <= 20 and num % 2 == 0:
    print("\nчерный")
elif 1 <= num <= 10 and num % 2 == 1:
    print("\nкрасный")

###

if 29 <= num <= 36 and num % 2 == 0:
    print("\nкрасный")
elif 1 <= num <= 10 and num % 2 == 1:
    print("\nчерный")
###

